Revit 2027 API
ViewShapeBuilder.AddCurve Method
 Add a curve to the GRep associated to this ViewShapeBuilder.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddCurve(
	Curve GCurve
)
Public Sub AddCurve (
	GCurve As Curve
)
public:
void AddCurve(
	Curve^ GCurve
)
member AddCurve :
        GCurve : Curve -> unit
Parameters
GCurve Curve
 The curve to be added.
Exceptions
Exception | Condition
ArgumentException |  GCurve is not acceptable for view-specific shape representation that is currently being built.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewShapeBuilder Class
Autodesk.Revit.DB Namespace